[
  {
    "name": "magic",
    "title": "Intro",
    "content": "I've always found it funny how the whole world is obsessed with wizards and magic but almost no one has any desire to try the magic that actually exists in the world.\n\nI remember reading Harry Potter as a kid. I would think to myself, 'if only we had magic in the real world - life would be so exciting! I'd do nothing but study magic and become the best wizard in the world.'\n\nWell, it turns out we do have magic. It's called programming, and it allows us to do things that would make Dumbledore jealous. We can create machines that clean our clothes or wake us up in the morning, and robots that drive around our living rooms and vacuum our floors.\n\nWizards in the movies dedicate years of their lives reading dusty old books that look like they're written in ancient, cryptic languages. And that's actually not a bad description for what it feels like trying to learn a programming language like Haskell.\n\nBut the real magic is that anyone can be a programmer - there are no muggles. All it takes is time to learn the language. The problem with the way most people teach programming is that they start with rules and theory using languages that look like ancient Greek. But languages, even programming languages, are for people, not computers. So we'll learn with one that's easy to read and more powerful than most of the other languages out there. This language is called Elm.\n\nLet's begin.",
    "images": [
      "http://placehold.it/350x150"
    ]
  },
  {
    "name": "magic",
    "title": "Intro",
    "content": "Programming languages are the same as any spoken language. We have words, we have rules for how to order the words, and we have meanings for the words. Here's a sentence:

  "A girl walks into a bar and asks the bartender for a double entendre, so he gave it to her."

  Some words are grouped together to create one meaning. The words "double" and "entendre" have individual meanings on their own, but when they're put together they mean something completely different. In this sentence, they just go together. The two words "A girl" go together too. Neither would really make sense in the sentence on their own.

  Other words have meanings all by themselves. The word "walks" means a specific action. It doesn't really *go* with any other word.

  We call each grouping of words that creates a meaning an **expression**. "A girl" is an expression - the two words go together. So is "double entendre". "he" is an expression of just one word - it means something by itself.",
    "images": [
      "http://placehold.it/350x150"
    ]
  }
]
